
&Перед("ПриНачалеРаботыСистемы")
Процедура Расш_ПриНачалеРаботыСистемы(Знач ОповещениеЗавершения, НепрерывноеВыполнение)
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();	
	
	ЗначениеДопРеквизита = ИнтерфейсРаботникаСклада.ПолучитьРабочееМесто(ТекущийПользователь);
	
	Если ЗначениеДопРеквизита <> Неопределено Тогда
		
		ИнтерфейсРаботникаСклада.НастроитьИнтерфейсРаботникуСклада();
		ОбновитьИнтерфейс(); 	
		ОткрытьФорму("Обработка.РабочееМесто.Форма." + СтрЗаменить(ЗначениеДопРеквизита, " ", ""));	
		
	КонецЕсли;
	
КонецПроцедуры
