
////////////////////////////////////////////////////////////////////////////////
// Прочее (Не имеет отношение к 1С)

// Возвращает данные
Функция ПолучитьОтветПоОплате(Организация, Контрагент, Договор, ДатаР) Экспорт
	
	ДатаКЭШ = КонецДня(ДатаР) + 5*24*60*60;
	ДатаТМ = КонецМесяца(ДатаР);
	ДатаПМ = КонецМесяца(ДатаТМ + 24*60*60);
	ДатаППМ = КонецМесяца(ДатаПМ + 24*60*60);
	ТекДата = ТекущаяДата();

	Приход = 0;
	Расход = 0;
	РасходКЭШ = 0;
	РасходТМ = 0;
	РасходПМ = 0;
	РасходППМ = 0;
	
	
	///////////////////////////
	Запрос2 = Новый Запрос(
	"ВЫБРАТЬ
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	РасчетыСКлиентами.ВидДвижения КАК ВидДвижения,
	|	СУММА(ВЫРАЗИТЬ(РасчетыСКлиентами.Сумма КАК ЧИСЛО(15, 2))) КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|ГДЕ
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация = &Организация
	|	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
	|	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор = &Договор
	|	И РасчетыСКлиентами.ДатаРегистратора <= &ДатаРегистратора
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентами.ВидДвижения,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидДвижения");
	Запрос2.УстановитьПараметр("Организация", Организация);
	Запрос2.УстановитьПараметр("Контрагент", Контрагент);
	Запрос2.УстановитьПараметр("Договор", Договор);
	Запрос2.УстановитьПараметр("ДатаРегистратора", ДатаР);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса2 = Запрос2.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса2.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка2 = РезультатЗапроса2.Выбрать();
	
	Если Выборка2.Следующий() Тогда
		//Возврат Новый Структура("Ответственный, ОтветственныйДолжность", Выборка.Ответственный, Выборка.ОтветственныйДолжность);
		Приход = Выборка2.Сумма;		
	КонецЕсли;
	
	///////////////////////////////
	
	//Если ДатаКЭШ <= ТекДата Тогда
	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор КАК Договор,
		|	РасчетыСКлиентами.ВидДвижения КАК ВидДвижения,
		|	СУММА(ВЫРАЗИТЬ(РасчетыСКлиентами.Сумма КАК ЧИСЛО(15, 2))) КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
		|ГДЕ
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация = &Организация
		|	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
		|	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор = &Договор
		|	И РасчетыСКлиентами.ДатаРегистратора <= &ДатаРегистратора
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСКлиентами.ВидДвижения,
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент,
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация,
		|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидДвижения УБЫВ");
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Договор", Договор);
		Запрос.УстановитьПараметр("ДатаРегистратора", ДатаКЭШ);
	
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
	
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Неопределено;
		КонецЕсли;
	
		Выборка = РезультатЗапроса.Выбрать();
	
		Если Выборка.Следующий() Тогда
			//Возврат Новый Структура("Ответственный, ОтветственныйДолжность", Выборка.Ответственный, Выборка.ОтветственныйДолжность);
			РасходКЭШ = Выборка.Сумма;		
		КонецЕсли;
	
		/////////////////
	
	
		Если Приход <= РасходКЭШ Тогда
		
			Возврат "КЭШ";
		Иначе
		
			Если ДатаТМ <= ТекДата Тогда
				
				/////////////////////////////
		
				Запрос3 = Новый Запрос(
				"ВЫБРАТЬ
				|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация КАК Организация,
				|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
				|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор КАК Договор,
				|	РасчетыСКлиентами.ВидДвижения КАК ВидДвижения,
				|	СУММА(ВЫРАЗИТЬ(РасчетыСКлиентами.Сумма КАК ЧИСЛО(15, 2))) КАК Сумма
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
				|ГДЕ
				|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация = &Организация
				|	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
				|	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор = &Договор
				|	И РасчетыСКлиентами.ДатаРегистратора <= &ДатаРегистратора
				|
				|СГРУППИРОВАТЬ ПО
				|	РасчетыСКлиентами.ВидДвижения,
				|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент,
				|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация,
				|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВидДвижения УБЫВ");
				Запрос3.УстановитьПараметр("Организация", Организация);
				Запрос3.УстановитьПараметр("Контрагент", Контрагент);
				Запрос3.УстановитьПараметр("Договор", Договор);
				Запрос3.УстановитьПараметр("ДатаРегистратора", ДатаТМ);
	
				УстановитьПривилегированныйРежим(Истина);
				РезультатЗапроса3 = Запрос3.Выполнить();
				УстановитьПривилегированныйРежим(Ложь);
	
				Если РезультатЗапроса3.Пустой() Тогда
					Возврат Неопределено;
				КонецЕсли;
	
				Выборка3 = РезультатЗапроса3.Выбрать();
	
				Если Выборка3.Следующий() Тогда
					//Возврат Новый Структура("Ответственный, ОтветственныйДолжность", Выборка.Ответственный, Выборка.ОтветственныйДолжность);
					РасходТМ = Выборка3.Сумма;		
				КонецЕсли;

				//////////////////////
	
				Если Приход <= РасходТМ Тогда
		
					Возврат "ТМ";
				Иначе
					
					Если ДатаПМ <= ТекДата Тогда
						
						/////////////////////////////	
	
						Запрос4 = Новый Запрос(
						"ВЫБРАТЬ
						|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация КАК Организация,
						|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
						|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор КАК Договор,
						|	РасчетыСКлиентами.ВидДвижения КАК ВидДвижения,
						|	СУММА(ВЫРАЗИТЬ(РасчетыСКлиентами.Сумма КАК ЧИСЛО(15, 2))) КАК Сумма
						|ИЗ
						|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
						|ГДЕ
						|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация = &Организация
						|	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
						|	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор = &Договор
						|	И РасчетыСКлиентами.ДатаРегистратора <= &ДатаРегистратора
						|
						|СГРУППИРОВАТЬ ПО
						|	РасчетыСКлиентами.ВидДвижения,
						|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент,
						|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация,
						|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор
						|
						|УПОРЯДОЧИТЬ ПО
						|	ВидДвижения УБЫВ");
						Запрос4.УстановитьПараметр("Организация", Организация);
						Запрос4.УстановитьПараметр("Контрагент", Контрагент);
						Запрос4.УстановитьПараметр("Договор", Договор);
						Запрос4.УстановитьПараметр("ДатаРегистратора", ДатаПМ);
	
						УстановитьПривилегированныйРежим(Истина);
						РезультатЗапроса4 = Запрос4.Выполнить();
						УстановитьПривилегированныйРежим(Ложь);
	
						Если РезультатЗапроса4.Пустой() Тогда
							Возврат Неопределено;
						КонецЕсли;
	
						Выборка4 = РезультатЗапроса4.Выбрать();
	
						Если Выборка4.Следующий() Тогда
							//Возврат Новый Структура("Ответственный, ОтветственныйДолжность", Выборка.Ответственный, Выборка.ОтветственныйДолжность);
							РасходПМ = Выборка4.Сумма;		
						КонецЕсли;

	
						//////////////////////
	
						Если Приход <= РасходПМ Тогда
		
							Возврат "ПМ";
						Иначе
							
							Если ДатаППМ <= ТекДата Тогда

								/////////////////////////////	
	
								Запрос5 = Новый Запрос(
								"ВЫБРАТЬ
								|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация КАК Организация,
								|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
								|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор КАК Договор,
								|	РасчетыСКлиентами.ВидДвижения КАК ВидДвижения,
								|	СУММА(ВЫРАЗИТЬ(РасчетыСКлиентами.Сумма КАК ЧИСЛО(15, 2))) КАК Сумма
								|ИЗ
								|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
								|ГДЕ
								|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация = &Организация
								|	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент
								|	И РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор = &Договор
								|	И РасчетыСКлиентами.ДатаРегистратора <= &ДатаРегистратора
								|
								|СГРУППИРОВАТЬ ПО
								|	РасчетыСКлиентами.ВидДвижения,
								|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Контрагент,
								|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Организация,
								|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам.Договор
								|
								|УПОРЯДОЧИТЬ ПО
								|	ВидДвижения УБЫВ");
								Запрос5.УстановитьПараметр("Организация", Организация);
								Запрос5.УстановитьПараметр("Контрагент", Контрагент);
								Запрос5.УстановитьПараметр("Договор", Договор);
								Запрос5.УстановитьПараметр("ДатаРегистратора", ДатаППМ);
	
								УстановитьПривилегированныйРежим(Истина);
								РезультатЗапроса5 = Запрос5.Выполнить();
								УстановитьПривилегированныйРежим(Ложь);
	
								Если РезультатЗапроса5.Пустой() Тогда
									Возврат Неопределено;
								КонецЕсли;
	
								Выборка5 = РезультатЗапроса5.Выбрать();
	
								Если Выборка5.Следующий() Тогда
									//Возврат Новый Структура("Ответственный, ОтветственныйДолжность", Выборка.Ответственный, Выборка.ОтветственныйДолжность);
									РасходППМ = Выборка5.Сумма;		
								КонецЕсли;

	
								//////////////////////
	
								Если Приход <= РасходППМ Тогда
		
									Возврат "ППМ";
								Иначе
									
									Возврат "НеЗачет";
								КонецЕсли; 
								
							Иначе
								
								Возврат "Ожидается";
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
						
						Возврат "Ожидается";
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Возврат "Ожидается";
			КонецЕсли;
			
		КонецЕсли;


	//Иначе 
	//	
	//	Возврат "Ожидается"; 	
	//КонецЕсли;
	
КонецФункции
