
&Вместо("ОткрытьФормуОтправкиSMS")
Процедура Расш_ОткрытьФормуОтправкиSMS(Знач Адресаты, Знач Текст, Знач Предмет, Знач ОтправлятьВТранслите)
	ПараметрыСообщения = Новый Структура;
	
	ПараметрыСообщения.Вставить("Адресаты", Адресаты);
	ПараметрыСообщения.Вставить("Текст", Текст);
	ПараметрыСообщения.Вставить("Предмет", Предмет);
	ПараметрыСообщения.Вставить("ОтправлятьВТранслите", ОтправлятьВТранслите);
	ПараметрыСообщения.Вставить("ДатаКогдаОтправить", ОтправлятьВТранслите); 	
	ПараметрыСообщения.Вставить("ЗначенияЗаполнения", Новый Структура("ДокументПредмет", Предмет));
	
	ОткрытьФорму("Документ.СообщениеSMS.ФормаОбъекта", ПараметрыСообщения);

КонецПроцедуры
