  &НаСервере
  Процедура Расш_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	  нРеквизиты = Новый Массив;
	  нРеквизиты.Добавить(Новый РеквизитФормы("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15,2), "Объект.Товары", "bos_Количество", Истина));
	  ИзменитьРеквизиты(нРеквизиты);
	  
	  нЭлемент = Элементы.Добавить("Количество", Тип("ПолеФормы"), Элементы.Товары);
	  нЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	  нЭлемент.ПутьКДанным = "Объект.Товары.bos_Количество";
	  
	  Элементы.Переместить(нЭлемент, Элементы.Товары, Элементы.ТоварыЦена);  
  КонецПроцедуры
  