Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивТЧ = Новый Массив;
	МассивТЧ.Добавить("Заливка");
	МассивТЧ.Добавить("Нарезка");
	МассивТЧ.Добавить("Выкладка");
		
	Для каждого Элем Из МассивТЧ Цикл 
		
		Для каждого ТекСтр Из ЭтотОбъект[Элем] Цикл   
			
			Если ЗначениеЗаполнено(ТекСтр.КоличествоУпаковок) Тогда
			
				ПроверяемыеРеквизиты.Добавить(Элем + ".Номенклатура");
				ПроверяемыеРеквизиты.Добавить(Элем + ".Характеристика");
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла;  
	
	Если Не ЗначениеЗаполнено(Бригада) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указана бригада!";
		Сообщение.Поле = "Бригада";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЦеховаяКладовая) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указана цеховая кладовая!";
		Сообщение.Поле = "ЦеховаяКладовая";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
		
	КонецЕсли;
						
КонецПроцедуры	