&После("ПриНачалеРаботыСистемы")
Процедура Расш_ПриНачалеРаботыСистемы()
	
	Попытка
		
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();			
		
	Исключение
		
		ТекущийПользователь =  Неопределено;
		
	КонецПопытки;
	
	Если ТекущийПользователь <> Неопределено Тогда
		
		ЗначениеДопРеквизита = ИнтерфейсРаботникаСклада.ПолучитьРабочееМесто(ТекущийПользователь);
		
		Если ЗначениеДопРеквизита <> Неопределено Тогда
			
			ИнтерфейсРаботникаСклада.НастроитьИнтерфейсРаботникуСклада();
			ОбновитьИнтерфейс(); 	
			ОткрытьФорму("Обработка.РабочееМесто.Форма." + СтрЗаменить(ЗначениеДопРеквизита, " ", ""));	
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры
