
Функция ПолучитьРабочееМесто(ТекПользователь) Экспорт
		
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Рабочее место");
	Возврат УправлениеСвойствами.ЗначениеСвойства(ТекПользователь, Свойство);

КонецФункции

Процедура НастроитьИнтерфейсРаботникуСклада() Экспорт

	Экраны = ПолучитьИнформациюЭкрановКлиента();
	
	ВысотаЭкрана = Экраны[0].Высота;
	ШиринаЭкрана = Экраны[0].Ширина;
	
	ВыполнитьНастройкуПанелей();
	
КонецПроцедуры

Процедура ВыполнитьНастройкуПанелей()
	
	НастройкиИнтерфейса = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	
	НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();
	НастройкиСостава.Верх.Очистить();
	НастройкиСостава.Лево.Очистить();
	НастройкиСостава.Низ.Очистить();
	НастройкиСостава.Право.Очистить();
	
	ПанельИнструментов = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов");
	ПанельОткрытых = Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых");
	НастройкиСостава.Лево.Добавить(ПанельИнструментов); 
	НастройкиСостава.Низ.Добавить(ПанельОткрытых);

	НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);
	
	// Если же хотим менять настройки, которые установил пользователь себе, 
	// тогда нужно прочитать его настройки из хранилища, и метод ПолучитьСостав()
	// вернёт не то, что в конфигураторе, а то, что пользователь установил себе.
	//
	// НастройкиИнтерфейса = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения");
	// НастройкиСостава = НастройкиИнтерфейса.ПолучитьСостав();    
	// ... изменть настройки состава
	// НастройкиИнтерфейса.УстановитьСостав(НастройкиСостава);
	// ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", , НастройкиИнтерфейса);
	
КонецПроцедуры

Функция ПолучитьСсылкуПоГуид(ПолноеИмя, СтрокаGUID) Экспорт
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	
	НовыйGUID = Новый УникальныйИдентификатор(СтрокаGUID);
	
	Возврат Менеджер.ПолучитьСсылку(НовыйGUID);	
	
КонецФункции

Функция ПрочитатьГлобальнуюНастройку(ИдентификаторНастройки) Экспорт
    
    ТекстЗапроса =
    "ВЫБРАТЬ
    |    ГлобНастройки.Данные,
    |    ГлобНастройки.ИдентификаторНастройки
    |ИЗ
    |    РегистрСведений.ЕБ_ГлобальныеНастройки КАК ГлобНастройки
    |ГДЕ
    |    ГлобНастройки.ИдентификаторНастройки = &Идентификатор";
    
    
    Запрос = Новый Запрос(ТекстЗапроса);
    Запрос.УстановитьПараметр("Идентификатор", ИдентификаторНастройки);
    Обход = Запрос.Выполнить().Выбрать();
    
    Возврат ?(Обход.Следующий(), Обход.Данные.Получить(), Неопределено);
    
КонецФункции

Процедура СохранитьГлобальнуюНастройку(Знач Идентификатор, Знач СохраняемыеДанные) Экспорт
	
	Хранилище = Новый ХранилищеЗначения(СохраняемыеДанные);
	
	Запись = РегистрыСведений.Идентификатор.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторНастройки = Идентификатор;
	Запись.Данные = Хранилище;
	Запись.Записать(Истина);
	
КонецПроцедуры 