&НаКлиенте
Перем ТекущиеДанные;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторНастройки = Параметры.ИдентификаторНастройки;	
	СохраненныеНастройки = ИнтерфейсРаботникаСклада.ПрочитатьГлобальнуюНастройку(ИдентификаторНастройки);
	Если ТипЗнч(СохраненныеНастройки) = Тип("ТаблицаЗначений") Тогда	
		ТЗНастройки.Загрузить(СохраненныеНастройки);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ТЗ = ТЗНастройки.Выгрузить();
	ИнтерфейсРаботникаСклада.СохранитьГлобальнуюНастройку(ИдентификаторНастройки, ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНаСервере();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Сохранить(Команда);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
